# ReverseIterator Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CategoryNameMap..::..ReverseIterator Method
CategoryNameMap Class See Also
---
Retrieve a backward moving iterator to the map.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual CategoryNameMapIterator ReverseIterator()
```

Visual Basic
---
```text
Public Overridable Function ReverseIterator As CategoryNameMapIterator
```

Visual C++
---
```text
public:
virtual CategoryNameMapIterator^ ReverseIterator()
```

# ### Return Value
Returns a backward moving iterator to the map.
# See Also
CategoryNameMap Class
Autodesk.Revit.DB Namespace